#include "checkfite.h"
#include "sp.h"
//#include <iostream>
#include "stdio.h"
#include <stdlib.h>

int checkfite(int b, int b1, int b2, int b3, int b4, char aa[9][9])
{
    int i, t = 0, f;
    if (aa[b3][b2] == 'k' || aa[b3][b2] == 'K') {
        return 1;
    }
    // fitemove
    if (aa[b1][b] == 'p' || aa[b1][b] == 'P') { //пешки
        if (aa[b1][b] == 'P') {                 // team1
            if (b3 >= b1 - 1 && b3 < b1 && abs(b - b2) == 1) {
                if (!(aa[b3][b2] == '.')) { //наличие
                    f = aa[b1][b];
                    if (f > 64 && f < 91) { //выс рег
                        f = aa[b3][b2];
                        if (!(f > 96 && f < 123)) { //низ рег
                            t = 1;
                        }
                    } else {
                        t = 1;
                    }
                } else {
                    t = 1;
                }
            } else {
                t = 1;
            }

        } else if (aa[b1][b] == 'p') {                         // team2
            if (b3 <= b1 + 1 && b3 > b1 && abs(b - b2) == 1) { //
                if (!(aa[b3][b2] == '.')) {                    //наличие
                    f = aa[b1][b];
                    if (f > 96 && f < 123) { //низ рег
                        f = aa[b3][b2];
                        if (!(f > 64 && f < 91)) { //выс рег
                            t = 1;
                        }
                    } else {
                        t = 1;
                    }
                } else {
                    t = 1;
                }
            } else {
                t = 1;
            }
        }
    }
    if (aa[b1][b] == 'r' || aa[b1][b] == 'R') { //ладья
        if (b == b2) {                          //вертикаль
            if (b1 > b3) {                      //вперед
                for (i = b1; i > b3 + 1; i--) { //вертикаль цыфры (b1 -- b3)
                    if (!(aa[i - 1][b] == '.')) { //есть п-е
                        t = 1;
                    }
                }
                f = aa[b1][b];
                if (f > 64 && f < 91) { //выс рег
                    f = aa[b3][b2];
                    if (!(f > 96 && f < 123)) { //низ рег
                        t = 1;
                    }
                } else if (f > 96 && f < 123) {
                    f = aa[b3][b2];
                    if (!(f > 64 && f < 91)) {
                        t = 1;
                    }
                } else {
                    t = 1;
                }
            }
            if (b1 < b3) {                      //назад
                for (i = b1; i < b3 - 1; i++) { //вертикаль цыфры (b1 -- b3)
                    if (!(aa[i + 1][b] == '.')) { //есть п-е
                        t = 1;
                    }
                }
                f = aa[b1][b];
                if (f > 64 && f < 91) { //выс рег
                    f = aa[b3][b2];
                    if (!(f > 96 && f < 123)) { //низ рег
                        t = 1;
                    }
                } else if (f > 96 && f < 123) {
                    f = aa[b3][b2];
                    if (!(f > 64 && f < 91)) {
                        t = 1;
                    }
                } else {
                    t = 1;
                }
            }
        } else {
            t = 1;
        }

        if (b != b2) {                             //горизонт
            if (b > b2) {                          //влево
                for (i = b; i > b2 + 1; i--) {     //горизонт (b -- b2)
                    if (!(aa[b1][i - 1] == '.')) { //есть п-е
                        t = 1;
                    }
                }
                f = aa[b1][b];
                if (f > 64 && f < 91) { //выс рег
                    f = aa[b3][b2];
                    if (!(f > 96 && f < 123)) { //низ рег
                        t = 1;
                    }
                } else if (f > 96 && f < 123) {
                    f = aa[b3][b2];
                    if (!(f > 64 && f < 91)) {
                        t = 1;
                    } else {
                        t = 1;
                    }
                }
            }
            if (b < b2) {                          //вправо
                for (i = b; i < b2 - 1; i++) {     //горизонт (b -- b2)
                    if (!(aa[b1][i + 1] == '.')) { //есть п-е
                        t = 1;
                    }
                }
                f = aa[b1][b];
                if (f > 64 && f < 91) { //выс рег
                    f = aa[b3][b2];
                    if (!(f > 96 && f < 123)) { //низ рег
                        t = 1;
                    }
                } else if (f > 96 && f < 123) {
                    f = aa[b3][b2];
                    if (!(f > 64 && f < 91)) {
                        t = 1;
                    } else {
                        t = 1;
                    }
                }
            }
        }
    }
    if (aa[b1][b] == 'n' || aa[b1][b] == 'N') { //конь
        if (b != b2 && b1 != b3) { //проверка вертикали и горизонта
            if (b3 == b1 + 2 || b3 == b1 - 2) {   //вертикаль
                if (b2 == b + 1 || b2 == b - 1) { //горизонт
                    if (!(aa[b3][b2] == '.')) {
                        f = aa[b1][b];
                        if (f > 64 && f < 91) { //выс рег
                            f = aa[b3][b2];
                            if (!(f > 96 && f < 123)) { //низ рег
                                t = 1;
                            }
                        } else if (f > 96 && f < 123) {
                            f = aa[b3][b2];
                            if (!(f > 64 && f < 91)) {
                                t = 1;
                            }
                        } else {
                            t = 1;
                        }
                    } else {
                        t = 1;
                    }
                } else {
                    t = 1;
                }
            } else if (b2 == b + 2 || b2 == b - 2) { //горизонт
                if (b3 == b1 + 1 || b3 == b1 - 1) {  //вертикаль
                    if (!(aa[b3][b2] == '.')) {
                        f = aa[b1][b];
                        if (f > 64 && f < 91) { //выс рег
                            f = aa[b3][b2];
                            if (!(f > 96 && f < 123)) { //низ рег
                                t = 1;
                            }
                        } else if (f > 96 && f < 123) {
                            f = aa[b3][b2];
                            if (!(f > 64 && f < 91)) {
                                t = 1;
                            }
                        } else {
                            t = 1;
                        }
                    } else {
                        t = 1;
                    }
                } else {
                    t = 1;
                }
            } else {
                t = 1;
            }
        } else {
            t = 1;
        }
    }
    if (aa[b1][b] == 'B' || aa[b1][b] == 'b') { //слон
        if (abs(b1 - b3) == abs(b - b2)) {      //ход по диоганали
            for (i = 1; i <= abs(b - b2) - 1; i++) {
                if (b > b2 && b1 > b3) { //лево-верх
                    if (!(aa[b1 - i][b - i] == '.')) {
                        t = 1;
                    }
                } else if (b > b2 && b1 < b3) { //лево-низ
                    if (!(aa[b1 + i][b - i] == '.')) {
                        t = 1;
                    }
                } else if (b < b2 && b1 < b3) { //право-низ
                    if (!(aa[b1 + i][b + i] == '.')) {
                        t = 1;
                    }
                } else if (b < b2 && b1 > b3) { //право-верх
                    if (!(aa[b1 - i][b + i] == '.')) {
                        t = 1;
                    }
                } else {
                    t = 1;
                }
            }
            f = aa[b1][b];
            if (f > 64 && f < 91) { //выс рег
                f = aa[b3][b2];
                if (!(f > 96 && f < 123)) { //низ рег
                    t = 1;
                }
            } else if (f > 96 && f < 123) {
                f = aa[b3][b2];
                if (!(f > 64 && f < 91)) {
                    t = 1;
                }
            } else {
                t = 1;
            }
        } else {
            t = 1;
        }
    }
    if (aa[b1][b] == 'K' || aa[b1][b] == 'k') {      //король
        if (abs(b - b2) <= 1 && abs(b1 - b3) <= 1) { //не дальше шага
            if (!(aa[b3][b2] == '.')) {
                f = aa[b1][b];
                if (f > 64 && f < 91) { //выс рег
                    f = aa[b3][b2];
                    if (!(f > 96 && f < 123)) { //низ рег
                        t = 1;
                    }
                } else if (f > 96 && f < 123) {
                    f = aa[b3][b2];
                    if (!(f > 64 && f < 91)) {
                        t = 1;
                    }
                } else {
                    t = 1;
                }
            } else {
                t = 1;
            }
        } else {
            t = 1;
        }
    }
    if (aa[b1][b] == 'Q' || aa[b1][b] == 'q') { //королева
        if (b == b2) {                          //вертикаль
            if (b1 > b3) {                      //вперед
                for (i = b1; i > b3 + 1; i--) { //вертикаль цыфры (b1 -- b3)
                    if (!(aa[i - 1][b] == '.')) { //есть п-е
                        t = 1;
                    }
                }
                f = aa[b1][b];
                if (f > 64 && f < 91) { //выс рег
                    f = aa[b3][b2];
                    if (!(f > 96 && f < 123)) { //низ рег
                        t = 1;
                    }
                } else if (f > 96 && f < 123) {
                    f = aa[b3][b2];
                    if (!(f > 64 && f < 91)) {
                        t = 1;
                    }
                } else {
                    t = 1;
                }
            }
            if (b1 < b3) {                      //назад
                for (i = b1; i < b3 - 1; i++) { //вертикаль цыфры (b1 -- b3)
                    if (!(aa[i + 1][b] == '.')) { //есть п-е
                        t = 1;
                    }
                }
                f = aa[b1][b];
                if (f > 64 && f < 91) { //выс рег
                    f = aa[b3][b2];
                    if (!(f > 96 && f < 123)) { //низ рег
                        t = 1;
                    }
                } else if (f > 96 && f < 123) {
                    f = aa[b3][b2];
                    if (!(f > 64 && f < 91)) {
                        t = 1;
                    }
                } else {
                    t = 1;
                }
            }
        } else if (b != b2 && b1 == b3) {          //горизонт
            if (b > b2) {                          //влево
                for (i = b; i > b2 + 1; i--) {     //горизонт (b -- b2)
                    if (!(aa[b1][i - 1] == '.')) { //есть п-е
                        t = 1;
                    }
                }
                f = aa[b1][b];
                if (f > 64 && f < 91) { //выс рег
                    f = aa[b3][b2];
                    if (!(f > 96 && f < 123)) { //низ рег
                        t = 1;
                    }
                } else if (f > 96 && f < 123) {
                    f = aa[b3][b2];
                    if (!(f > 64 && f < 91)) {
                        t = 1;
                    }
                } else {
                    t = 1;
                }
                if (!(b1 == b3)) { //проверка горизонт
                    t = 1;
                }
            }
            if (b < b2) {                          //вправо
                for (i = b; i < b2 - 1; i++) {     //горизонт (b -- b2)
                    if (!(aa[b1][i + 1] == '.')) { //есть п-е
                        t = 1;
                    }
                }
                f = aa[b1][b];
                if (f > 64 && f < 91) { //выс рег
                    f = aa[b3][b2];
                    if (!(f > 96 && f < 123)) { //низ рег
                        t = 1;
                    }
                } else if (f > 96 && f < 123) {
                    f = aa[b3][b2];
                    if (!(f > 64 && f < 91)) {
                        t = 1;
                    }
                } else {
                    t = 1;
                }
                if (!(b1 == b3)) { //проверка вертикали
                    t = 1;
                }
            }
        } else if (abs(b1 - b3) == abs(b - b2)) { //ход по
                                                  //диоганали
            for (i = 1; i <= abs(b - b2) - 1; i++) {
                if (b > b2 && b1 > b3) { //лево-верх
                    if (!(aa[b1 - i][b - i] == '.')) {
                        t = 1;
                    }
                } else if (b > b2 && b1 < b3) { //лево-низ
                    if (!(aa[b1 + i][b - i] == '.')) {
                        t = 1;
                    }
                } else if (b < b2 && b1 < b3) { //право-низ
                    if (!(aa[b1 + i][b + i] == '.')) {
                        t = 1;
                    }
                } else if (b < b2 && b1 > b3) { //право-верх
                    if (!(aa[b1 - i][b + i] == '.')) {
                        t = 1;
                    }
                } else {
                    t = 1;
                }
            }
            f = aa[b1][b];
            if (f > 64 && f < 91) { //выс рег
                f = aa[b3][b2];
                if (!(f > 96 && f < 123)) { //низ рег
                    t = 1;
                }
            } else if (f > 96 && f < 123) {
                f = aa[b3][b2];
                if (!(f > 64 && f < 91)) {
                    t = 1;
                }
            } else {
                t = 1;
            }
        }
    }
    return t;
}
